eisup_2019_docmng_integration/src/Documents/абс_ПриведениеРегистровКОСВ/абс_ПриведениеРегистровКОСВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ПриведениеРегистровКОСВ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижений</name>
    <type>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийПриведениеРегистровКОСВ</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПриведениеРегистровКОСВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаполнения</name>
    <comment>0 - по всем , 1 - без признака в договоре &quot;Вести по документам..&quot; 2- с признаком </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеОСВ</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОСВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегистр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСуммаОСВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСуммаРегистр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВестиПоДокументам</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сторнировать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСуммаРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеРегистра</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегистр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСуммаРегистр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>DocumentRef.СчетНаОплатуПоставщика</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОСВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСуммаОСВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПриведениеРегистровКОСВ/абс_СтатусыПриведениеРегистровКОСВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПриведениеРегистровКОСВ</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаВыполнена</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетФормированиеДвижений</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ПриведениеРегистровКОСВ/ObjectModule.bsl
Процедура ЗаполнитьДокумент() Экспорт
	
	ЗаполнитьДокумент_Взаиморасчеты();
	
КонецПроцедуры

Процедура ЗаполнитьДанныеРегистра() Экспорт
	
	ЗаполнитьДанныеРегистра_Взаиморасчеты();
	
КонецПроцедуры


Процедура ЗаполнитьДокумент_Взаиморасчеты()
	
	Источник = ЭтотОбъект;
	Источник.ДанныеОСВ.Очистить();
	Источник.ДанныеРегистра.Очистить();
		
	ДеревоРассхождений = Документы.абс_ПриведениеРегистровКОСВ.ПолучитьДеревоРассхождений_Взаиморасчеты(
																Источник.Организация,
																Источник.Дата,
																Документы.абс_ПриведениеРегистровКОСВ.ПолучитьМассивСчетов(Источник.Операция),
																Документы.абс_ПриведениеРегистровКОСВ.ПолучитьЗнакОстатка(Источник.Операция));
																
	Для Каждого строкаСчет из ДеревоРассхождений.Строки Цикл 
		Для Каждого строкаКонтрагент из строкаСчет.Строки Цикл 																	
			Для Каждого строкаДоговор из строкаКонтрагент.Строки Цикл
				
				Если строкаДоговор.ВестиПоДокументам = Null Тогда 
					ВестиПоДокументам = Ложь;
				Иначе 
					ВестиПоДокументам = строкаДоговор.ВестиПоДокументам;
				КонецЕсли;
					
				Если (Источник.ВидЗаполнения = 1) И (ВестиПоДокументам) Тогда 
					Продолжить;
				КонецЕсли;
				
				Если (Источник.ВидЗаполнения = 2) И (НЕ ВестиПоДокументам) Тогда 
					Продолжить;
				КонецЕсли;
				
				//Если (строкаДоговор.СуммаОСВ  - строкаДоговор.СуммаРегистр = 0) И
				//	(строкаДоговор.ВалютнаяСуммаОСВ  - строкаДоговор.ВалютнаяСуммаРегистр = 0) Тогда 
				//	Продолжить;
				//КонецЕсли;

				строкаДанныеОСВ = Источник.ДанныеОСВ.Добавить();
				ЗаполнитьЗначенияСвойств(строкаДанныеОСВ, строкаДоговор);
				строкаДанныеОСВ.Субконто1 = строкаДоговор.Контрагент;
				строкаДанныеОСВ.Субконто2 = строкаДоговор.ДоговорКонтрагента;
				строкаДанныеОСВ.Ключ = Новый УникальныйИдентификатор();
				Если строкаДанныеОСВ.СуммаОСВ = 0 И  строкаДанныеОСВ.ВалютнаяСуммаОСВ = 0 Тогда 
					строкаДанныеОСВ.Сторнировать = Истина;
					Продолжить;
				КонецЕсли;
				
				строкаДанныеОСВ.СуммаРасхождение = строкаДанныеОСВ.СуммаОСВ  - строкаДанныеОСВ.СуммаРегистр;
				строкаДанныеОСВ.ВалютнаяСуммаРасхождение = строкаДанныеОСВ.ВалютнаяСуммаОСВ  - строкаДанныеОСВ.ВалютнаяСуммаРегистр;

				Для Каждого строкаДокумент из строкаДоговор.Строки Цикл 
					строкаДанныеРегистра = Источник.ДанныеРегистра.Добавить();
					ЗаполнитьЗначенияСвойств(строкаДанныеРегистра, строкаДокумент);
					строкаДанныеРегистра.Ключ = строкаДанныеОСВ.Ключ; 
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеРегистра_Взаиморасчеты(Ключ = Неопределено) Экспорт
	
	Источник = ЭтотОбъект;

	Если Ключ = Неопределено Тогда 
		ТаблицаОбхода = Источник.ДанныеОСВ;
	Иначе
		ТаблицаОбхода = Источник.ДанныеОСВ.НайтиСтроки(Новый Структура("Ключ", Ключ));
	КонецЕсли;
	
	Для Каждого строка из ТаблицаОбхода Цикл 
		
		Если (строка.ВестиПоДокументам) И (Ключ = Неопределено) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(строка.Субконто1) Тогда 
			Продолжить;
		КонецЕсли;
		
		//Если (строка.СуммаРасхождение = 0) И (строка.ВалютнаяСуммаРасхождение = 0) И (Ключ = Неопределено) Тогда 
		//	Продолжить;
		//КонецЕсли;
		
		Если строка.Сторнировать Тогда  
			МассивСтрок = Источник.ДанныеРегистра.НайтиСтроки(Новый Структура("Ключ", строка.Ключ));
			Для Каждого строкаРегистра из МассивСтрок Цикл 
				Источник.ДанныеРегистра.Удалить(строкаРегистра);	
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		
		ТаблицаРаспределния = Документы.абс_ПриведениеРегистровКОСВ.ПолучитьТаблицуКорректировочногоРаспределения_Взаиморасчеты(
													Источник.Организация, 
													Источник.Дата, 
													строка.Счет, 
													строка.Субконто1, 
													строка.Субконто2, 
													строка.СуммаОСВ, 
													строка.ВалютнаяСуммаОСВ, 
													Документы.абс_ПриведениеРегистровКОСВ.ПолучитьЗнакОстатка(Источник.Операция),
													?(ЗначениеЗаполнено(Источник.Ссылка), Источник.Ссылка, Неопределено));
		
		МассивСтрок = Источник.ДанныеРегистра.НайтиСтроки(Новый Структура("Ключ", строка.Ключ));
		Для Каждого строкаРегистра из МассивСтрок Цикл 
			Источник.ДанныеРегистра.Удалить(строкаРегистра);	
		КонецЦикла;
		
		СуммаРегистр = 0;
		ВалютнаяСуммаРегистр = 0;
		
		Для Каждого строкаРаспределения из ТаблицаРаспределния Цикл 
			строкаРегистра = Источник.ДанныеРегистра.Добавить();
			ЗаполнитьЗначенияСвойств(строкаРегистра,  строкаРаспределения);
			строкаРегистра.Ключ = строка.Ключ;
			СуммаРегистр = СуммаРегистр + строкаРегистра.СуммаРегистр;
			ВалютнаяСуммаРегистр = ВалютнаяСуммаРегистр + строкаРегистра.ВалютнаяСуммаРегистр;
		КонецЦикла;
		
		строка.СуммаРегистр = СуммаРегистр;
		строка.ВалютнаяСуммаРегистр = ВалютнаяСуммаРегистр;
		
		строка.СуммаРасхождение = строка.СуммаОСВ - СуммаРегистр; 
		строка.ВалютнаяСуммаРасхождение = строка.ВалютнаяСуммаОСВ - ВалютнаяСуммаРегистр; 
		
	КонецЦикла;
	
КонецПроцедуры



Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Статус = Перечисления.абс_СтатусыПриведениеРегистровКОСВ.Подготовка;
	Ответственный = глЗначениеПеременной("глТекущийПользователь");
	Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если Статус = Перечисления.абс_СтатусыПриведениеРегистровКОСВ.Отказ Тогда 
		абс_ПроведениеДокументов.УдалитьДвиженияРегистратора(ДокументДвижений);
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументДвижений = Документы.КорректировкаЗаписейРегистров.ПустаяСсылка();
	Статус = Перечисления.абс_СтатусыПриведениеРегистровКОСВ.Подготовка;
	Ответственный = глЗначениеПеременной("глТекущийПользователь");
	ДанныеОСВ.Очистить();
	ДанныеРегистра.Очистить();
		
КонецПроцедуры
